In [3]:
import pandas as pd

In [308]:
# Load the three datasets into dataframes
donations = pd.read_csv('C:/Users/SANTIAGO/OneDrive - Nova Scotia Community College/4 Winter Semester 2024/DBAS 3018 Data Movement and Integration/Assignment 2/Datasets/Clean/2013-2017 Bike Donations_CLEAN.csv')
events = pd.read_csv('C:/Users/SANTIAGO/OneDrive - Nova Scotia Community College/4 Winter Semester 2024/DBAS 3018 Data Movement and Integration/Assignment 2/Datasets/Clean/2013-2017 Bike Events_CLEAN.csv')
participants = pd.read_csv('C:/Users/SANTIAGO/OneDrive - Nova Scotia Community College/4 Winter Semester 2024/DBAS 3018 Data Movement and Integration/Assignment 2/Datasets/Clean/2013-2017 Bike MS Participants_CLEAN.csv')

#Create tables

In [275]:
#Participant table
participants.columns

columns_to_drop_participants = ['t_name']
participants_table = participants.drop(columns=columns_to_drop_participants)

participants_table.columns

Index(['p_gender', 'p_state', 'p_city', 'p_goal_amt', 'contactID', 'teamID',
       'eventID'],
      dtype='object')

In [281]:
#drop donorID duplicates
participants_table_clean = participants_table.drop_duplicates(subset='contactID')

In [283]:
#check for duplicates
duplicates_exist = participants_table_clean['contactID'].duplicated().any()
duplicates_exist

False

In [285]:
# Drop rows where 'contactID' is null in 'participants_table' to create 'participants_table_clean'
participants_table_clean = participants_table_clean.dropna(subset=['contactID'])

In [287]:
null_donorID_count = participants_table_clean['contactID'].isnull().sum()
null_donorID_count

0

In [289]:
#Extract clean file
participants_table_clean.to_csv('C:/Users/SANTIAGO/OneDrive - Nova Scotia Community College/4 Winter Semester 2024/DBAS 3018 Data Movement and Integration/Assignment 2/Datasets/Clean/participants_table.csv', index=False)

In [210]:
#team

# Drop specific columns from the 'participants' dataframe to create 'team_table'
columns_to_drop_team = ['p_gender', 'p_state', 'p_city', 'p_goal_amt', 'contactID']
team_table = participants.drop(columns=columns_to_drop_team)

# Drop rows where 'teamID' is null in 'team_table' to create 'team_table_clean'
team_table_clean = team_table.dropna(subset=['teamID'])

# Check the columns of 'team_table_clean'
print(team_table_clean.columns)

# Print 'team_table_clean' to view the cleaned dataframe
print(team_table_clean)

Index(['teamID', 't_name'], dtype='object')
          teamID                        t_name
2       451067.0                 Taylor's Team
3       449427.0                Team Kate4Test
9       452531.0  FSC - Team Test for the Best
11      453915.0                        Mickey
13      452531.0  FSC - Team Test for the Best
...          ...                           ...
448835  352278.0            The Flying Monkeys
448836  395458.0              Don't MS With Us
448837  351752.0                    Team Wendy
448838  351768.0                 Kari's Cadets
448839  352278.0            The Flying Monkeys

[359620 rows x 2 columns]

In [212]:
# Convert the 'teamID' column to integer and then to string

# Modify the 'teamID' column
team_table_clean.loc[:, 'teamID'] = team_table_clean['teamID'].astype(int).astype(str)

In [214]:
team_table_clean.head()

    teamID                        t_name
2   451067                 Taylor's Team
3   449427                Team Kate4Test
9   452531  FSC - Team Test for the Best
11  453915                        Mickey
13  452531  FSC - Team Test for the Best

In [220]:
#drop donorID duplicates
team_table_clean = team_table_clean.drop_duplicates(subset='teamID')

In [222]:
#check for duplicates
duplicates_exist = team_table_clean['teamID'].duplicated().any()
duplicates_exist

False

In [224]:
#Extract clean file
team_table_clean.to_csv('C:/Users/SANTIAGO/OneDrive - Nova Scotia Community College/4 Winter Semester 2024/DBAS 3018 Data Movement and Integration/Assignment 2/Datasets/Clean/team_table.csv', index=False)

In [320]:
#Donor

donations.columns

Index(['d_gender', 'd_county', 'd_state', 'donationID', 'd_city',
       'do_add_gift_amt', 'donorID', 'do_gift_amt', 'do_date_recorded',
       'do_gift_type', 'do_fiscal_yr', 'do_amt_collected', 'p_contactID'],
      dtype='object')

In [332]:
columns_to_drop_donor = ['do_gift_amt','do_date_recorded','do_gift_type','do_fiscal_yr','do_amt_collected','do_add_gift_amt','donationID','p_contactID']
donor_table = donations.drop(columns=columns_to_drop_donor)

# Drop rows where 'teamID' is null in 'team_table' to create 'team_table_clean'
donor_table_clean = donor_table.dropna(subset=['donorID'])

donor_table_clean.columns

null_donorID_count = donor_table_clean['donorID'].isnull().sum()
null_donorID_count

0

In [334]:
donor_table_clean.head()

  d_gender   d_county d_state      d_city     donorID
0   Female      Hinds      MS     Jackson   7828995.0
1   Female  Jefferson      AL  Birmingham  11527263.0
2   Female  Jefferson      AL  Birmingham  11527263.0
3     Male     Denton      TX      Frisco  10244498.0
4   Female       Hays      TX      Austin  11415664.0

In [336]:
#drop donorID duplicates
donor_table_clean = donor_table_clean.drop_duplicates(subset='donorID')

In [338]:
#check for duplicates
duplicates_exist = donor_table_clean['donorID'].duplicated().any()
duplicates_exist

False

In [340]:
donor_table_clean.loc[:, 'donorID'] = donor_table_clean['donorID'].astype(int).astype(str)
donor_table_clean.head()

  d_gender   d_county d_state      d_city   donorID
0   Female      Hinds      MS     Jackson   7828995
1   Female  Jefferson      AL  Birmingham  11527263
3     Male     Denton      TX      Frisco  10244498
4   Female       Hays      TX      Austin  11415664
5     Male    Madison      MS     Madison  10548237

In [342]:
#Extract clean file
donor_table_clean.to_csv('C:/Users/SANTIAGO/OneDrive - Nova Scotia Community College/4 Winter Semester 2024/DBAS 3018 Data Movement and Integration/Assignment 2/Datasets/Clean/donor_table.csv', index=False)

In [312]:
#Donation
donations.columns

Index(['d_gender', 'd_county', 'd_state', 'donationID', 'd_city',
       'do_add_gift_amt', 'donorID', 'do_gift_amt', 'do_date_recorded',
       'do_gift_type', 'do_fiscal_yr', 'do_amt_collected', 'p_contactID'],
      dtype='object')

In [314]:
#Donation
columns_to_drop_donation = ['d_gender','d_county','d_state','d_city','donationID']
donation_table = donations.drop(columns=columns_to_drop_donation)

donation_table.columns

donation_table

,do_add_gift_amt,donorID,do_gift_amt,do_date_recorded,do_gift_type,do_fiscal_yr,do_amt_collected,p_contactID
0,0.0,7828995.0,100.0,2012-09-14 17:34:00,Online,2013,100.0,7744894.0
1,0.0,11527263.0,50.0,2012-09-21 14:10:00,Online,2013,50.0,7744894.0
2,0.0,11527263.0,25.0,2012-09-21 10:43:00,Online,2013,25.0,7744894.0
3,0.0,10244498.0,70.0,2012-10-02 15:58:00,Online,2013,70.0,10244498.0
4,0.0,11415664.0,25.0,2012-08-17 14:15:00,Online,2013,25.0,10244498.0
...,...,...,...,...,...,...,...,...
3807371,100.0,15614806.0,100.0,2017-05-16 08:57:00,Online,2017,100.0,15614806.0
3807372,100.0,16085762.0,50.0,2017-05-18 16:49:00,Online,2017,50.0,15614806.0
3807373,100.0,16083016.0,35.0,2017-05-17 20:07:00,Online,2017,35.0,15614806.0
3807374,0.0,16033523.0,50.0,2017-05-02 07:57:00,Online,2017,50.0,NaN
3807375,0.0,16122821.0,35.0,2017-06-07 08:49:00,Online,2017,35.0,NaN

In [316]:
# Convert the 'teamID' column to integer and then to string

# Convert to string, handling NaN and inf values
donation_table['donorID'] = donation_table['donorID'].apply(lambda x: str(int(x)) if pd.notna(x) else x)

donation_table.head()

,do_add_gift_amt,donorID,do_gift_amt,do_date_recorded,do_gift_type,do_fiscal_yr,do_amt_collected,p_contactID
0,0.0,7828995,100.0,2012-09-14 17:34:00,Online,2013,100.0,7744894.0
1,0.0,11527263,50.0,2012-09-21 14:10:00,Online,2013,50.0,7744894.0
2,0.0,11527263,25.0,2012-09-21 10:43:00,Online,2013,25.0,7744894.0
3,0.0,10244498,70.0,2012-10-02 15:58:00,Online,2013,70.0,10244498.0
4,0.0,11415664,25.0,2012-08-17 14:15:00,Online,2013,25.0,10244498.0

In [318]:
#Extract clean file
donation_table.to_csv('C:/Users/SANTIAGO/OneDrive - Nova Scotia Community College/4 Winter Semester 2024/DBAS 3018 Data Movement and Integration/Assignment 2/Datasets/Clean/donation_table.csv', index=False)

In [194]:
#Event
events.head()

      e_city  e_state               e_date  eventID  e_goal_amt
0    Unknown  Unknown  2016-09-01 08:42:00    27155       500.0
1  Fairbanks       AK  2016-03-19 14:39:00    27154    500000.0
2  Anchorage       AK  2016-09-01 13:02:00    26886       500.0
3    Unknown  Unknown  2016-12-31 23:39:00    27089       500.0
4    Unknown       AL  2015-01-01 12:16:00    26357     10000.0

In [198]:
#drop eventID duplicates
event_table_clean = events.drop_duplicates(subset='eventID')
event_table_clean.head()

      e_city  e_state               e_date  eventID  e_goal_amt
0    Unknown  Unknown  2016-09-01 08:42:00    27155       500.0
1  Fairbanks       AK  2016-03-19 14:39:00    27154    500000.0
2  Anchorage       AK  2016-09-01 13:02:00    26886       500.0
3    Unknown  Unknown  2016-12-31 23:39:00    27089       500.0
4    Unknown       AL  2015-01-01 12:16:00    26357     10000.0

In [200]:
#check for duplicates
duplicates_exist = event_table_clean['eventID'].duplicated().any()
duplicates_exist

False

In [202]:
#Extract clean file
event_table_clean.to_csv('C:/Users/SANTIAGO/OneDrive - Nova Scotia Community College/4 Winter Semester 2024/DBAS 3018 Data Movement and Integration/Assignment 2/Datasets/Clean/event_table.csv', index=False)